Revit 2027 API
ParameterTypeId.AnalyticalModelLength Property
 "Length": The length of Analytical Model
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalModelLength { get; }
Public Shared ReadOnly Property AnalyticalModelLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalModelLength {
	ForgeTypeId^ get ();
}
static member AnalyticalModelLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace